       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           BRADMA21.
      *  *****************************************
      *  *   ALTERAR  FUNCIONARIOS               *
      *  *****************************************
       AUTHOR.
           CLAUDIO.

       ENVIRONMENT    DIVISION.
       CONFIGURATION  SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS COMMA.

       INPUT-OUTPUT   SECTION.
       FILE-CONTROL.

       DATA           DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       77  WRK-SQLCODE-EDIT           PIC -999       VALUE ZEROS.
       77  WRK-SALFUN-EDIT            PIC ZZZ.ZZ9,99 VALUE ZEROS.
       01  WRK-AREA-ACCEPT.
           02 WRK-CODFUN.
               03 FILLER              PIC X(10).
               03 WRK-CODFUN-ACCEPT   PIC X(06)    VALUE SPACES.
           02 WRK-NOMEFUN.
               03 FILLER              PIC X(10).
               03 WRK-NOMEFUN-ACCEPT   PIC X(30)    VALUE SPACES.
           02 WRK-DEPTOFUN.
               03 FILLER              PIC X(10).
               03 WRK-DEPTOFUN-ACCEPT   PIC X(05)    VALUE SPACES.
           02 WRK-SALFUN.
               03 FILLER              PIC X(10).
               03 WRK-SALFUN-ACCEPT   PIC 9(06)V99 VALUE ZEROS.
           02 WRK-ADMISSFUN.
               03 FILLER              PIC X(10).
               03 WRK-ADMISSFUN-ACCEPT PIC X(10)    VALUE SPACES.
           02 WRK-FILHOSFUN.
               03 FILLER              PIC X(10).
               03 WRK-FILHOSFUN-ACCEPT PIC 9(04)    VALUE ZEROS.
           02 WRK-EMAILFUN.
               03 FILLER              PIC X(10).
               03 WRK-EMAILFUN-ACCEPT PIC X(30)    VALUE SPACES.

           EXEC SQL
               INCLUDE REGFUN
           END-EXEC.
           EXEC SQL
               INCLUDE SQLCA
           END-EXEC.

       PROCEDURE      DIVISION.
       0000-PRINCIPAL SECTION.
       0001-PRINCIPAL.
           PERFORM 1001-INICIALIZAR.
           PERFORM 2001-PROCESSAR.
           PERFORM 3001-FINALIZAR.
           STOP RUN.

       1000-INICIALIZAR SECTION.
       1001-INICIALIZAR.
           ACCEPT  WRK-CODFUN    FROM SYSIN.
           ACCEPT  WRK-NOMEFUN   FROM SYSIN.
           ACCEPT  WRK-DEPTOFUN  FROM SYSIN.
           ACCEPT  WRK-SALFUN    FROM SYSIN.
           ACCEPT  WRK-ADMISSFUN FROM SYSIN.
           ACCEPT  WRK-FILHOSFUN FROM SYSIN.
           ACCEPT  WRK-EMAILFUN  FROM SYSIN.

       2000-PROCESSAR SECTION.
       2001-PROCESSAR.
           MOVE    WRK-CODFUN-ACCEPT       TO  DB2-CODFUN.
           IF WRK-NOMEFUN-ACCEPT NOT = SPACES
               PERFORM 2010-ALTERA-NOME
           END-IF.
           IF WRK-DEPTOFUN-ACCEPT NOT = SPACES
               PERFORM 2011-ALTERA-DEPARTAMENTO
           END-IF.
           IF WRK-SALFUN-ACCEPT IS NUMERIC
               PERFORM 2012-ALTERA-SALARIO
           END-IF.
           IF WRK-ADMISSFUN-ACCEPT NOT = SPACES
               PERFORM 2013-ALTERA-ADMISSAO
           END-IF.
           IF WRK-FILHOS-ACCEPT IS NUMERIC
               PERFORM 2014-ALTERA-FILHOS
           END-IF.
           IF WRK-EMAILFUN-ACCEPT NOT = SPACES
               PERFORM 2015-ALTERA-EMAIL
           END-IF.
       2010-ALTERA-NOME.
           MOVE    WRK-NOMEFUN-ACCEPT      TO  DB2-NOMEFUN-TEXT.
           PERFORM VARYING DB2-NOMEFUN-LEN FROM 30 BY -1
                UNTIL DB2-NOMEFUN-TEXT(DB2-NOMEFUN-LEN:1) NOT = SPACES
           END-PERFORM.
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET NOMEFUN = :DB2-NOMEFUN
               WHERE CODFUN = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'NOME DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADO PARA ' DB2-NOMEFUN-TEXT
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DO NOME'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
       2011-ALTERA-DEPARTAMENTO.
           MOVE    WRK-DEPTOFUN-ACCEPT     TO DB2-DEPTOFUN.
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET DEPTOFUN = :DB2-DEPTOFUN
               WHERE CODFUN = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'DEPARTAMENTO DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADO PARA ' DB2-DEPTOFUN
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN -530
                   DISPLAY 'DEPARTAMENTO ' DB2-DEPTOFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DO DEPARTAMENTO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
       2012-ALTERA-SALARIO.
           MOVE    WRK-SALFUN-ACCEPT       TO DB2-SALFUN.
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET SALFUN   = :DB2-SALFUN
               WHERE CODFUN = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   MOVE DB2-SALFUN     TO WRK-SALFUN-EDIT
                   DISPLAY 'SALARIO DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADO PARA ' WRK-SALFUN-EDIT
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DO SALARIO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
       2013-ALTERA-ADMISSAO.
           MOVE ALL '/'                    TO DB2-ADMISSFUN.
           MOVE    WRK-ADMISSFUN-ACCEPT(5:4) TO DB2-ADMISSFUN(1:4).
           MOVE    WRK-ADMISSFUN-ACCEPT(3:2) TO DB2-ADMISSFUN(6:2).
           MOVE    WRK-ADMISSFUN-ACCEPT(1:2) TO DB2-ADMISSFUN(9:2).
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET ADMISSFUN   = :DB2-ADMISSFUN
               WHERE CODFUN    = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'ADMISSAO DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADA PARA ' DB2-ADMISSFUN
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN -181
                  DISPLAY 'DATA DE ADMISSAO ' DB2-ADMISSFUNC
                          ' INVALIDA'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DA ADMISSAO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
       2014-ALTERA-FILHOS.
           MOVE    WRK-FILHOSFUN-ACCEPT      TO DB2-FILHOSFUN.
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET FILHOSFUN   = :DB2-FILHOSFUN
               WHERE CODFUN    = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'FILHOS DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADO PARA ' DB2-FILHOSFUN
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DE FILHOS'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
       2015-ALTERA-EMAIL.
           MOVE    WRK-EMAILFUN-ACCEPT       TO DB2-EMAILFUN-TEXT.
           PERFORM VARYING DB2-EMAILFUN-LEN FROM 30 BY -1
                UNTIL DB2-EMAILFUN-TEXT(DB2-EMAILFUN-LEN:1)
                                            NOT = SPACES
           END-PERFORM.
           EXEC SQL
               UPDATE BRADMA.FUNCIONARIOS
               SET EMAILFUN   = :DB2-EMAILFUN
               WHERE CODFUN   = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'EMAIL DO FUNCIONARIO ' DB2-CODFUN
                           ' FOI ALTERADO PARA '   DB2-EMAILFUN
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NA ALTERACAO DO EMAIL'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.

       3000-FINALIZAR SECTION.
       3001-FINALIZAR.
           EXIT.
