//XXXXXXXX JOB 'COMP DB2',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID
//*-------------------------------------------------------------------* 
//*      JOB DE COMPILACAO DE PROGRAMA COBOL COM DB2 BATCH            * 
//*      NAME = SEU PROGRAMA  -                      
//*-------------------------------------------------------------------* 
//         JCLLIB ORDER=GR.GERAL.PROCLIB                                
//COMPDB2B EXEC DFHCODB2,NAME=XXXXXXX,INSTR=XXXXXXXX                     
//LKED.SYSIN    DD   *
  NAME XXXXXXXX(R)
//*
//BIND.SYSTSIN  DD *                                                    
DSN  SYSTEM(DB8G)
BIND PLAN(XXXXXXX) MEM(XXXXXXX) ACT(REP) ISOLATION(CS) -              
       LIB('DSN810.DBRMLIB.DATA')                                       
END                                                                     
//*                                                                    
