       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           BRADMA20.
      *  *****************************************
      *  *    EXCLUIR FUNCIONARIOS               *
      *  *****************************************
       AUTHOR.
           CLAUDIO.

       ENVIRONMENT    DIVISION.
       CONFIGURATION  SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS COMMA.

       INPUT-OUTPUT   SECTION.
       FILE-CONTROL.

       DATA           DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       77  WRK-SQLCODE-EDIT           PIC -999       VALUE ZEROS.
       01  WRK-AREA-ACCEPT.
           02 WRK-CODFUN-ACCEPT       PIC X(06)    VALUE SPACES.

           EXEC SQL
               INCLUDE REGFUN
           END-EXEC.
           EXEC SQL
               INCLUDE SQLCA
           END-EXEC.

       PROCEDURE      DIVISION.
       0000-PRINCIPAL SECTION.
       0001-PRINCIPAL.
           PERFORM 1001-INICIALIZAR.
           PERFORM 2001-PROCESSAR.
           PERFORM 3001-FINALIZAR.
           STOP RUN.

       1000-INICIALIZAR SECTION.
       1001-INICIALIZAR.
           ACCEPT  WRK-AREA-ACCEPT FROM SYSIN.

       2000-PROCESSAR SECTION.
       2001-PROCESSAR.
           MOVE    WRK-CODFUN-ACCEPT       TO  DB2-CODFUN.
           EXEC SQL
               DELETE FROM BRADMA.FUNCIONARIOS
               WHERE CODFUN = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' FOI EXCLUIDO'
               WHEN 100
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NO DELETE DO FUNCIONARIO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.

       3000-FINALIZAR SECTION.
       3001-FINALIZAR.
           EXIT.
