       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           BRADMA19.
      *  *****************************************
      *  *    INCLUIR FUNCIONARIOS               *
      *  *****************************************
       AUTHOR.
           CLAUDIO.

       ENVIRONMENT    DIVISION.
       CONFIGURATION  SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS COMMA.

       INPUT-OUTPUT   SECTION.
       FILE-CONTROL.

       DATA           DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       77  WRK-SQLCODE-EDIT           PIC -999       VALUE ZEROS.
       01  WRK-AREA-ACCEPT.
           02 WRK-CODFUN.
               03 FILLER              PIC X(10).
               03 WRK-CODFUN-ACCEPT   PIC X(06)    VALUE SPACES.
           02 WRK-NOMEFUN.
               03 FILLER              PIC X(10).
               03 WRK-NOMEFUN-ACCEPT   PIC X(30)    VALUE SPACES.
           02 WRK-DEPTOFUN.
               03 FILLER              PIC X(10).
               03 WRK-DEPTOFUN-ACCEPT   PIC X(05)    VALUE SPACES.
           02 WRK-SALFUN.
               03 FILLER              PIC X(10).
               03 WRK-SALFUN-ACCEPT   PIC 9(06)V99 VALUE ZEROS.
           02 WRK-ADMISSFUN.
               03 FILLER              PIC X(10).
               03 WRK-ADMISSFUN-ACCEPT PIC X(10)    VALUE SPACES.
           02 WRK-FILHOSFUN.
               03 FILLER              PIC X(10).
               03 WRK-FILHOSFUN-ACCEPT PIC 9(04)    VALUE ZEROS.
           02 WRK-EMAILFUN.
               03 FILLER              PIC X(10).
               03 WRK-EMAILFUN-ACCEPT PIC X(30)    VALUE SPACES.

           EXEC SQL
               INCLUDE REGFUN
           END-EXEC.
           EXEC SQL
               INCLUDE SQLCA
           END-EXEC.

       PROCEDURE      DIVISION.
       0000-PRINCIPAL SECTION.
       0001-PRINCIPAL.
           PERFORM 1001-INICIALIZAR.
           PERFORM 2001-PROCESSAR.
           PERFORM 3001-FINALIZAR.
           STOP RUN.

       1000-INICIALIZAR SECTION.
       1001-INICIALIZAR.
           ACCEPT  WRK-CODFUN    FROM SYSIN.
           ACCEPT  WRK-NOMEFUN   FROM SYSIN.
           ACCEPT  WRK-DEPTOFUN  FROM SYSIN.
           ACCEPT  WRK-SALFUN    FROM SYSIN.
           ACCEPT  WRK-ADMISSFUN FROM SYSIN.
           ACCEPT  WRK-FILHOSFUN FROM SYSIN.
           ACCEPT  WRK-EMAILFUN  FROM SYSIN.

       2000-PROCESSAR SECTION.
       2001-PROCESSAR.
           MOVE    WRK-CODFUN-ACCEPT       TO  DB2-CODFUN.
           MOVE    WRK-NOMEFUN-ACCEPT      TO  DB2-NOMEFUN-TEXT.
           PERFORM VARYING DB2-NOMEFUN-LEN FROM 30 BY -1
                UNTIL DB2-NOMEFUN-TEXT(DB2-NOMEFUN-LEN:1) NOT = SPACES
           END-PERFORM.
           MOVE    WRK-DEPTOFUN-ACCEPT     TO DB2-DEPTOFUN.
           MOVE    WRK-SALFUN-ACCEPT       TO DB2-SALFUN.
           MOVE ALL '/'                    TO DB2-ADMISSFUN.
           MOVE    WRK-ADMISSFUN-ACCEPT(5:4) TO DB2-ADMISSFUN(1:4).
           MOVE    WRK-ADMISSFUN-ACCEPT(3:2) TO DB2-ADMISSFUN(6:2).
           MOVE    WRK-ADMISSFUN-ACCEPT(1:2) TO DB2-ADMISSFUN(9:2).
           MOVE    WRK-FILHOSFUN-ACCEPT      TO DB2-FILHOSFUN.
           MOVE    WRK-EMAILFUN-ACCEPT       TO DB2-EMAILFUN-TEXT.
           PERFORM VARYING DB2-EMAILFUN-LEN FROM 30 BY -1
                UNTIL DB2-EMAILFUN-TEXT(DB2-EMAILFUN-LEN:1)
                                            NOT = SPACES
           END-PERFORM.
           EXEC SQL
               INSERT INTO BRADMA.FUNCIONARIOS
               VALUES(:DB2-CODFUN,
                      :DB2-NOMEFUN,
                      :DB2-DEPTOFUN,
                      :DB2-SALFUN,
                      :DB2-ADMISSFUN,
                      :DB2-FILHOSFUN,
                      :DB2-EMAILFUN)
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' FOI INCLUIDO'
               WHEN -803
                   DISPLAY 'FUNCIONARIO ' DB2-CODFUN
                           ' JA EXISTE'
               WHEN -530
                   DISPLAY 'DEPARTAMENTO ' DB2-DEPTOFUN
                           ' NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NO INSERT DO FUNCIONARIO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.

       3000-FINALIZAR SECTION.
       3001-FINALIZAR.
           EXIT.
