       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           BRADMA16.
      *  ***************************************
      *  *    LER E EXIBIR 1 FUNCIONARIO (DB2) *
      *  ***************************************
       AUTHOR.
           CLAUDIO.

       ENVIRONMENT    DIVISION.
       CONFIGURATION  SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS COMMA.

       INPUT-OUTPUT   SECTION.
       FILE-CONTROL.

       DATA           DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       77  WRK-SALARIO-EDIT           PIC ZZZ.ZZ9,99 VALUE ZEROS.
       77  WRK-SQLCODE-EDIT           PIC -999       VALUE ZEROS.
       77  WRK-CODFUN-ACCEPT          PIC X(6)       VALUE SPACES.

           EXEC SQL
               INCLUDE REGFUN
           END-EXEC.
           EXEC SQL
               INCLUDE SQLCA
           END-EXEC.

       PROCEDURE      DIVISION.
       0000-PRINCIPAL SECTION.
       0001-PRINCIPAL.
           PERFORM 1001-INICIALIZAR.
           IF SQLCODE = 0
               PERFORM 2001-PROCESSAR
           END-IF.
           PERFORM 3001-FINALIZAR.
           STOP RUN.

       1000-INICIALIZAR SECTION.
       1001-INICIALIZAR.
           ACCEPT WRK-CODFUN-ACCEPT   FROM SYSIN.
           PERFORM 4001-LER-FUNCIONARIO.

       2000-PROCESSAR SECTION.
       2001-PROCESSAR.
           MOVE DB2-SALFUN            TO WRK-SALARIO-EDIT.

           DISPLAY 'CODIGO...: ' DB2-CODFUN.
           DISPLAY 'NOME.....: ' DB2-NOMEFUN-TEXT.
           DISPLAY 'DEPTO....: ' DB2-DEPTOFUN.
           DISPLAY 'SALARIO..: ' WRK-SALARIO-EDIT.
           DISPLAY 'ADMISSAO.: ' DB2-ADMISSFUN.
           DISPLAY 'FILHOS...: ' DB2-FILHOSFUN.
           DISPLAY 'EMAIL....: ' DB2-EMAILFUN-TEXT.
           DISPLAY ' '.

       3000-FINALIZAR SECTION.
       3001-FINALIZAR.
           EXIT.

       4000-LEITURAS SECTION.
       4001-LER-FUNCIONARIO.
           MOVE WRK-CODFUN-ACCEPT  TO DB2-CODFUN.
           EXEC SQL
               SELECT *
               INTO :REG-FUNCIONARIOS
               FROM BRADMA.FUNCIONARIOS
               WHERE CODFUN = :DB2-CODFUN
           END-EXEC.
           EVALUATE SQLCODE
               WHEN 0
                   CONTINUE
               WHEN 100
                   DISPLAY 'FUNCIONARIO NAO EXISTE'
               WHEN OTHER
                   MOVE SQLCODE    TO WRK-SQLCODE-EDIT
                   DISPLAY 'ERRO '    WRK-SQLCODE-EDIT
                           ' NO SELECT DO FUNCIONARIO'
      *        FORCAR MAXXCC = 08
                   MOVE 08 TO RETURN-CODE
                   STOP RUN
           END-EVALUATE.
